Documents/СписаниеСКорпоративныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>СписаниеСКорпоративныхКарт</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияПоКорпоративнымКартам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСКорпоративнымиКартами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>Корпоративный банковский счет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Comment>Банковский счет организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПППлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПППолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредствБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредствБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаТранзакции</Name>
							<Comment>Дата транзакции</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТранзакции</Name>
							<Comment>Тип транзакции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКорпоративнойКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КорпоративныеБанковскиеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Физлицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплачено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВходящегоДокумента</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчередностьПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПлатежа</Name>
							<Comment>электронно, почтой, телеграфом</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеСКорпоративныхКарт/Ext/ObjectModule.bsl
Функция ПолучитьСчетОрганизации()
	
	ТекСчетОрганизации = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	Если НЕ ЭтотОбъект.Организация.Пустая()
			И НЕ ЭтотОбъект.СчетКонтрагента.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация"	, ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("НомерСчета"	, ЭтотОбъект.СчетКонтрагента.НомерСчета);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СпрБанковскиеСчета.Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК СпрБанковскиеСчета
		|ГДЕ
		|	СпрБанковскиеСчета.Владелец = &Организация
		|	И СпрБанковскиеСчета.НомерСчета = &НомерСчета
		|	И НЕ СпрБанковскиеСчета.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекСчетОрганизации = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекСчетОрганизации;
	
КонецФункции


Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.НазначениеПлатежа = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// прописать счет организации - номер тот же, что и у счета контрагента, этот реквизит (СчетОрганизации) - для отбора в ж.док-тов Банк
	ТекСчетОрганизации = ПолучитьСчетОрганизации();
	Если НЕ ЭтотОбъект.СчетОрганизации = ТекСчетОрганизации Тогда
		ЭтотОбъект.СчетОрганизации = ТекСчетОрганизации;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвиженияПоКартам = ЭтотОбъект.Движения.ДвиженияПоКорпоративнымКартам;
	ДвиженияПоКартам.Записывать = Истина;
	ДвиженияПоКартам.Очистить();
	
	Если ЭтотОбъект.Дата > ТекущаяДата() Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.РасшифровкаПлатежа Цикл
		
		Если НЕ СтрокаТЧ.Оплачено Тогда
			Продолжить;
		КонецЕсли;
		
		НовоеДвижение = ДвиженияПоКартам.ДобавитьПриход();
		НовоеДвижение.Период 		= ЭтотОбъект.Дата;
		НовоеДвижение.Организация 	= ЭтотОбъект.Организация;
		НовоеДвижение.ДатаСписания 	= ЭтотОбъект.Дата;
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТЧ);
		
	КонецЦикла;
	
	//Перем Заголовок;
	//
	//// Проверка ручной корректировки
	//Если ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(ЭтотОбъект.РучнаяКорректировка, Отказ, Заголовок, ЭтотОбъект,,
	//																Истина) Тогда
	//	Возврат
	//КонецЕсли;
	//
	//Если ЭтотОбъект.Оплачено Тогда
	//	
	//	Если ЭтотОбъект.ДатаОплаты = Дата(1, 1, 1) Тогда
	//		Сообщить("Не указана дата оплаты! Проведение невозможно.");	
	//		Отказ = Истина;
	//		Возврат
	//	КонецЕсли;
	//	
	//	ДвиженияФинансовый = ЭтотОбъект.Движения.Финансовый;
	//	ДвиженияФинансовый.Записывать = Истина;
	//	ДвиженияФинансовый.Очистить();
	//	
	//	Если ЭтотОбъект.ДатаОплаты < Дата(2015, 5, 1) Тогда
	//		
	//		Если ЭтотОбъект.Дата > ТекущаяДата() Тогда
	//			РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	//		КонецЕсли;
	//		
	//		Счет574 = ПланыСчетов.Финансовый.ПереводыНаКартыСотрудников;
	//		Счет712 = ПланыСчетов.Финансовый.РасчетыСПодотчетнымиЛицамиНаКартах;
	//		
	//		Для Каждого СтрокаТЧ Из ЭтотОбъект.РасшифровкаПлатежа Цикл
	//			
	//			// Дт71.2 Кт57.4
	//			Проводка = ДвиженияФинансовый.Добавить();
	//			Проводка.Период		= ЭтотОбъект.ДатаОплаты;
	//			Проводка.СчетКт		= Счет574;
	//			Проводка.СубконтоКт.Организации						= ЭтотОбъект.Организация;
	//			Проводка.СубконтоКт.ИсточникиДенежныхСредств		= ЭтотОбъект.СчетКонтрагента;
	//			Проводка.СубконтоКт.КорпоративныеБанковскиеКарты	= СтрокаТЧ.НомерКорпоративнойКарты;
	//			//Проводка.Организация			= Организация;
	//			
	//			Проводка.СчетДт		= Счет712;
	//			Проводка.СубконтоДт.Организации		= ЭтотОбъект.Организация;
	//			Проводка.СубконтоДт.ФизическиеЛица	= СтрокаТЧ.Физлицо;

	//			Проводка.Сумма		= СтрокаТЧ.Сумма;
	//			Проводка.Содержание	= "Перевод денежных средств физ. лица с корпоративного счета на карту";
	//			
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, ЭтотОбъект.РучнаяКорректировка, Истина,	Истина);
	
КонецПроцедуры
